
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/12973916735)


<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * aws_codedeploy_app.ecs
  * aws_codedeploy_deployment_group.ecs
* Update
  * aws_ecs_service.backend


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_codedeploy_app.ecs will be created
  + resource "aws_codedeploy_app" "ecs" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "ECS"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "ecs"
      + tags_all            = {
          + "Managed" = "Terraform"
        }
    }

  # aws_codedeploy_deployment_group.ecs will be created
  + resource "aws_codedeploy_deployment_group" "ecs" {
      + app_name                    = "ecs"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "ecs"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = "arn:aws:iam::992382441056:role/ECSCodeDeploy"
      + tags_all                    = {
          + "Managed" = "Terraform"
        }
      + termination_hook_enabled    = false

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout    = "STOP_DEPLOYMENT"
              + wait_time_in_minutes = 10
            }
          + green_fleet_provisioning_option (known after apply)
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 60
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "backend"
          + service_name = "backend"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:ap-northeast-1:992382441056:listener/app/internal/96f432c4ba7116aa/21bcce24cc4238fd",
                    ]
                }
              + target_group {
                  + name = "backend-blue"
                }
              + target_group {
                  + name = "backend-green"
                }
            }
        }
    }

  # aws_ecs_service.backend will be updated in-place
  ~ resource "aws_ecs_service" "backend" {
      - health_check_grace_period_seconds  = 60 -> null
        id                                 = "arn:aws:ecs:ap-northeast-1:992382441056:service/backend/backend"
        name                               = "backend"
        tags                               = {}
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":40,"Program":"tfcmt","SHA1":"413dd84b037c07fcd8b8edfd4ffa26074a37395a","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->